Hey @tjason1 👋 Thank you for taking the time to raise this! Support for `dynamic` blocks is a Terraform Core concept that's not enabled or disabled, but rather works inherently so long as the argument in question is a block type. In this case, `ip_sets` and `port_sets` can be used with `dynamic` blocks as is (notably, some of your example configuration uses the incorrect arguments in the blocks, which may be part what you're running into. 

Piecing together parts some of the examples from the [resource documentation](https://registry.terraform.io/providers/hashicorp/aws/latest/docs/resources/networkfirewall_rule_group#) (that is to say, this probably isn't a terribly useful configuration that you'd actually want to apply; just a demonstration of possibility), I put together this example configuration, which plans without issue:

```hcl
variable "rule_variables" {
  default = {
    ip_sets = [
      {
        key        = "WEBSERVERS_HOSTS",
        definition = ["10.0.0.0/16", "10.0.1.0/24", "192.168.0.0/16"]
      },
      {
        key        = "EXTERNAL_HOST",
        definition = ["1.2.3.4/32"]
      }
    ],
    port_sets = [
      {
        key        = "HTTP_PORTS",
        definition = ["443", "80"]
      }
    ]
  }
}

resource "aws_networkfirewall_rule_group" "example" {
  name     = "example-rule-group"
  capacity = 100
  type     = "STATEFUL"

  rule_group {
    rule_variables {
      dynamic "ip_sets" {
        for_each = toset(var.rule_variables.ip_sets)
        content {
          key = ip_sets.value.key
          ip_set {
            definition = ip_sets.value.definition
          }
        }
      }
      dynamic "port_sets" {
        for_each = toset(var.rule_variables.port_sets)
        content {
          key = port_sets.value.key
          port_set {
            definition = port_sets.value.definition
          }
        }
      }
    }

    rules_source {
      rules_source_list {
        generated_rules_type = "DENYLIST"
        target_types         = ["HTTP_HOST"]
        targets              = ["test.example.com"]
      }
    }
  }
}
```

Plan output:

```console
$ terraform plan

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_networkfirewall_rule_group.example will be created
  + resource "aws_networkfirewall_rule_group" "example" {
      + arn          = (known after apply)
      + capacity     = 100
      + id           = (known after apply)
      + name         = "example-rule-group"
      + tags_all     = (known after apply)
      + type         = "STATEFUL"
      + update_token = (known after apply)

      + rule_group {
          + rule_variables {
              + ip_sets {
                  + key = "EXTERNAL_HOST"

                  + ip_set {
                      + definition = [
                          + "1.2.3.4/32",
                        ]
                    }
                }
              + ip_sets {
                  + key = "WEBSERVERS_HOSTS"

                  + ip_set {
                      + definition = [
                          + "10.0.0.0/16",
                          + "10.0.1.0/24",
                          + "192.168.0.0/16",
                        ]
                    }
                }
              + port_sets {
                  + key = "HTTP_PORTS"

                  + port_set {
                      + definition = [
                          + "443",
                          + "80",
                        ]
                    }
                }
            }
          + rules_source {
              + rules_source_list {
                  + generated_rules_type = "DENYLIST"
                  + target_types         = [
                      + "HTTP_HOST",
                    ]
                  + targets              = [
                      + "test.example.com",
                    ]
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```